# Data Aggregation and Group Operations

In [2]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20

In [3]:
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

## GroupBy Mechanics

In [4]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.204708  1.393406
1    a  two  0.478943  0.092908
2    b  one -0.519439  0.281746
3    b  two -0.555730  0.769023
4    a  one  1.965781  1.246435

In [4]:
df.groupby(df['key1'])

In [6]:
a = df.groupby(df['key1'])

In [7]:
for m, n in a: # key1 (값은 a,b)에 대해서 groupby 했으므로 a와 b로 나누어진다.
    print(m)   # key값 - a에 해당하는 내용
    print(n)   # key값 - b에 해당하는 내용 
    print()

a
  key1 key2     data1     data2
0    a  one -0.204708  1.393406
1    a  two  0.478943  0.092908
4    a  one  1.965781  1.246435

b
  key1 key2     data1     data2
2    b  one -0.519439  0.281746
3    b  two -0.555730  0.769023

In [8]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [9]:
for m, n in grouped:   # grouped 가 data1에서 groupby 했으므로 data1에 대해서만 정렬
    print(m)
    print(n)
    print()

a
0   -0.204708
1    0.478943
4    1.965781
Name: data1, dtype: float64

b
2   -0.519439
3   -0.555730
Name: data1, dtype: float64

In [10]:
grouped.mean()

key1
a    0.746672
b   -0.537585
Name: data1, dtype: float64

In [11]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     0.880536
      two     0.478943
b     one    -0.519439
      two    -0.555730
Name: data1, dtype: float64

In [14]:
means.unstack()

key2       one       two
key1
a     0.880536  0.478943
b    -0.519439 -0.555730

In [16]:
means.unstack().stack()

key1  key2
a     one     0.880536
      two     0.478943
b     one    -0.519439
      two    -0.555730
dtype: float64

In [13]:
df

  key1 key2     data1     data2
0    a  one -0.204708  1.393406
1    a  two  0.478943  0.092908
2    b  one -0.519439  0.281746
3    b  two -0.555730  0.769023
4    a  one  1.965781  1.246435

In [17]:
df2 = df.copy()   # df는 값이 변하질 않는다.
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df2['states'] = states
df2['years'] = years
df2

  key1 key2     data1     data2      states  years
0    a  one -0.204708  1.393406        Ohio   2005
1    a  two  0.478943  0.092908  California   2005
2    b  one -0.519439  0.281746  California   2006
3    b  two -0.555730  0.769023        Ohio   2005
4    a  one  1.965781  1.246435        Ohio   2006

In [19]:
df2['data1'].groupby([states, years]).mean()

California  2005    0.478943
            2006   -0.519439
Ohio        2005   -0.380219
            2006    1.965781
Name: data1, dtype: float64

In [18]:
df

  key1 key2     data1     data2
0    a  one -0.204708  1.393406
1    a  two  0.478943  0.092908
2    b  one -0.519439  0.281746
3    b  two -0.555730  0.769023
4    a  one  1.965781  1.246435

In [20]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005    0.478943
            2006   -0.519439
Ohio        2005   -0.380219
            2006    1.965781
Name: data1, dtype: float64

In [21]:
df

  key1 key2     data1     data2
0    a  one -0.204708  1.393406
1    a  two  0.478943  0.092908
2    b  one -0.519439  0.281746
3    b  two -0.555730  0.769023
4    a  one  1.965781  1.246435

In [22]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.746672  0.910916
b    -0.537585  0.525384

In [27]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.880536  1.319920
     two   0.478943  0.092908
b    one  -0.519439  0.281746
     two  -0.555730  0.769023

In [28]:
df

  key1 key2     data1     data2
0    a  one -0.204708  1.393406
1    a  two  0.478943  0.092908
2    b  one -0.519439  0.281746
3    b  two -0.555730  0.769023
4    a  one  1.965781  1.246435

In [25]:
df.groupby(['key1', 'key2']).size()  # 열이랑은 관계없이 그룹에 포함된 빈도 수

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [26]:
df.groupby(['key1', 'key2']).count() # 키를 제외한 나머지 열에 대한 빈도 수

           data1  data2
key1 key2
a    one       2      2
     two       1      1
b    one       1      1
     two       1      1

### Iterating Over Groups

In [29]:
df

  key1 key2     data1     data2
0    a  one -0.204708  1.393406
1    a  two  0.478943  0.092908
2    b  one -0.519439  0.281746
3    b  two -0.555730  0.769023
4    a  one  1.965781  1.246435

In [30]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)
    print()

a
  key1 key2     data1     data2
0    a  one -0.204708  1.393406
1    a  two  0.478943  0.092908
4    a  one  1.965781  1.246435

b
  key1 key2     data1     data2
2    b  one -0.519439  0.281746
3    b  two -0.555730  0.769023

In [31]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)
    print()

('a', 'one')
  key1 key2     data1     data2
0    a  one -0.204708  1.393406
4    a  one  1.965781  1.246435

('a', 'two')
  key1 key2     data1     data2
1    a  two  0.478943  0.092908

('b', 'one')
  key1 key2     data1     data2
2    b  one -0.519439  0.281746

('b', 'two')
  key1 key2    data1     data2
3    b  two -0.55573  0.769023

In [32]:
dict(list(((1, 10), (2, 20), (3, 30))))

{1: 10, 2: 20, 3: 30}

In [33]:
pieces = dict(list(df.groupby('key1')))
pieces

{'a':   key1 key2     data1     data2
 0    a  one -0.204708  1.393406
 1    a  two  0.478943  0.092908
 4    a  one  1.965781  1.246435,
 'b':   key1 key2     data1     data2
 2    b  one -0.519439  0.281746
 3    b  two -0.555730  0.769023}

In [34]:
pieces['b']

  key1 key2     data1     data2
2    b  one -0.519439  0.281746
3    b  two -0.555730  0.769023

In [35]:
df

  key1 key2     data1     data2
0    a  one -0.204708  1.393406
1    a  two  0.478943  0.092908
2    b  one -0.519439  0.281746
3    b  two -0.555730  0.769023
4    a  one  1.965781  1.246435

In [36]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [38]:
grouped = df.groupby(df.dtypes, axis=1)
grouped

In [39]:
for dtype, group in grouped:
    print(dtype)
    print(group)
    print()

float64
      data1     data2
0 -0.204708  1.393406
1  0.478943  0.092908
2 -0.519439  0.281746
3 -0.555730  0.769023
4  1.965781  1.246435

object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

### Selecting a Column or Subset of Columns

df.groupby('key1')['data1']
df.groupby('key1')[['data2']]

In [40]:
df.groupby('key1')['data1'].mean() #결과: 시리즈

key1
a    0.746672
b   -0.537585
Name: data1, dtype: float64

In [41]:
df.groupby('key1')[['data2']].mean() #결과: DataFrame

         data2
key1
a     0.910916
b     0.525384

df['data1'].groupby(df['key1'])
df[['data2']].groupby(df['key1'])

In [42]:
df['data1'].groupby(df['key1'])

In [43]:
df[['data1']].groupby(df['key1'])

In [44]:
df.groupby(df['key1'])['data2']

In [45]:
df.groupby(df['key1'])[['data2']]

In [46]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one   1.319920
     two   0.092908
b    one   0.281746
     two   0.769023

In [47]:
df.groupby(['key1', 'key2'])['data2'].mean()

key1  key2
a     one     1.319920
      two     0.092908
b     one     0.281746
      two     0.769023
Name: data2, dtype: float64

In [48]:
type(df.groupby(['key1', 'key2'])[['data2']].mean())

pandas.core.frame.DataFrame

In [49]:
df.groupby(['key1', 'key2'])['data2'].mean()

key1  key2
a     one     1.319920
      two     0.092908
b     one     0.281746
      two     0.769023
Name: data2, dtype: float64

In [50]:
type(df.groupby(['key1', 'key2'])['data2'].mean())

pandas.core.series.Series

In [51]:
s_grouped = df.groupby(['key1', 'key2'])['data2']
s_grouped
s_grouped.mean()

key1  key2
a     one     1.319920
      two     0.092908
b     one     0.281746
      two     0.769023
Name: data2, dtype: float64

### Grouping with Dicts and Series

In [19]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people

               a         b         c         d         e
Joe     0.092908  0.281746  0.769023  1.246435  1.007189
Steve  -1.296221  0.274992  0.228913  1.352917  0.886429
Wes    -2.001637 -0.371843  1.669025 -0.438570 -0.539741
Jim     0.476985  3.248944 -1.021228 -0.577087  0.124121
Travis  0.302614  0.523772  0.000940  1.343810 -0.713544

In [53]:
people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values
people

               a         b         c         d         e
Joe     1.007189 -1.296221  0.274992  0.228913  1.352917
Steve   0.886429 -2.001637 -0.371843  1.669025 -0.438570
Wes    -0.539741       NaN       NaN -1.021228 -0.577087
Jim     0.124121  0.302614  0.523772  0.000940  1.343810
Travis -0.713544 -0.831154 -2.370232 -1.860761 -0.860757

In [54]:
mapping = {'a': 'red', 'b': 'red',
           'c': 'blue', 'd': 'blue',
           'e': 'red', 'f' : 'orange'}

In [55]:
by_column = people.groupby(mapping, axis=1)
by_column.sum()

            blue       red
Joe     0.503905  1.063885
Steve   1.297183 -1.553778
Wes    -1.021228 -1.116829
Jim     0.524712  1.770545
Travis -4.230992 -2.405455

In [56]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [57]:
people

               a         b         c         d         e
Joe     1.007189 -1.296221  0.274992  0.228913  1.352917
Steve   0.886429 -2.001637 -0.371843  1.669025 -0.438570
Wes    -0.539741       NaN       NaN -1.021228 -0.577087
Jim     0.124121  0.302614  0.523772  0.000940  1.343810
Travis -0.713544 -0.831154 -2.370232 -1.860761 -0.860757

In [58]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [60]:
people.groupby(map_series, axis=1).size()

blue    2
red     3
dtype: int64

In [59]:
people

               a         b         c         d         e
Joe     1.007189 -1.296221  0.274992  0.228913  1.352917
Steve   0.886429 -2.001637 -0.371843  1.669025 -0.438570
Wes    -0.539741       NaN       NaN -1.021228 -0.577087
Jim     0.124121  0.302614  0.523772  0.000940  1.343810
Travis -0.713544 -0.831154 -2.370232 -1.860761 -0.860757

* size()와 count()

In [4]:
df = pd.DataFrame({'a':[0,0,1,2,2,2], 'b':[1,2,3,4,np.NaN,4], 'c':np.random.randn(6)})
df

   a    b         c
0  0  1.0 -0.204708
1  0  2.0  0.478943
2  1  3.0 -0.519439
3  2  4.0 -0.555730
4  2  NaN  1.965781
5  2  4.0  1.393406

In [5]:
df.count()

a    6
b    5
c    6
dtype: int64

In [10]:
df.groupby(['a'])

In [11]:
df.groupby(['a'])['b'] # 데이터프레임 해당 열의 갯수

In [8]:
df.groupby(['a'])['b'].count() # 데이터프레임 해당 열의 갯수

a
0    2
1    1
2    2
Name: b, dtype: int64

In [12]:
df.groupby(['a']).count()

   b  c
a
0  2  2
1  1  1
2  2  3

In [13]:
df.groupby(['a'])['b'].size() # 그룹의 크기(수)

a
0    2
1    1
2    3
Name: b, dtype: int64

In [14]:
df.groupby(['a']).size() # 그룹의 크기(수)

a
0    2
1    1
2    3
dtype: int64

In [15]:
df = pd.DataFrame(
        {"Name":["Alice", "Bob", "Mallory", "Mallory", "Bob" , "Mallory"],
         "City":["Seattle", "Seattle", "Portland", "Seattle", "Seattle", "Portland"],
         "Val": [4, 3, 3, np.nan, np.nan, 4]})

df

      Name      City  Val
0    Alice   Seattle  4.0
1      Bob   Seattle  3.0
2  Mallory  Portland  3.0
3  Mallory   Seattle  NaN
4      Bob   Seattle  NaN
5  Mallory  Portland  4.0

In [16]:
df.groupby(["Name", "City"])['Val'].size()  # NaN도 size에는 포함된다

Name     City
Alice    Seattle     1
Bob      Seattle     2
Mallory  Portland    2
         Seattle     1
Name: Val, dtype: int64

In [17]:
df.groupby(["Name", "City"])['Val'].size().reset_index(name='Size')

      Name      City  Size
0    Alice   Seattle     1
1      Bob   Seattle     2
2  Mallory  Portland     2
3  Mallory   Seattle     1

In [ ]:
df.groupby(["Name", "City"])['Val'].count()

In [ ]:
df.groupby(["Name", "City"])['Val'].count().reset_index(name='Count')

### Grouping with Functions

In [20]:
people

               a         b         c         d         e
Joe     0.092908  0.281746  0.769023  1.246435  1.007189
Steve  -1.296221  0.274992  0.228913  1.352917  0.886429
Wes    -2.001637 -0.371843  1.669025 -0.438570 -0.539741
Jim     0.476985  3.248944 -1.021228 -0.577087  0.124121
Travis  0.302614  0.523772  0.000940  1.343810 -0.713544

In [21]:
people.groupby(len).sum()

          a         b         c         d         e
3 -1.431744  3.158848  1.416820  0.230778  0.591569
5 -1.296221  0.274992  0.228913  1.352917  0.886429
6  0.302614  0.523772  0.000940  1.343810 -0.713544

In [22]:
people.groupby(len, axis=1).sum()

               1
Joe     3.397301
Steve   1.447030
Wes    -1.682766
Jim     2.251735
Travis  1.457592

In [25]:
people

               a         b         c         d         e
Joe     0.092908  0.281746  0.769023  1.246435  1.007189
Steve  -1.296221  0.274992  0.228913  1.352917  0.886429
Wes    -2.001637 -0.371843  1.669025 -0.438570 -0.539741
Jim     0.476985  3.248944 -1.021228 -0.577087  0.124121
Travis  0.302614  0.523772  0.000940  1.343810 -0.713544

In [27]:
key_list = ['one', 'one', 'one', 'two', 'two']
people.groupby([len, key_list])

In [24]:
key_list = ['one', 'one', 'one', 'two', 'two']
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -2.001637 -0.371843  0.769023 -0.438570 -0.539741
  two  0.476985  3.248944 -1.021228 -0.577087  0.124121
5 one -1.296221  0.274992  0.228913  1.352917  0.886429
6 two  0.302614  0.523772  0.000940  1.343810 -0.713544

### Grouping by Index Levels

In [28]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                    [1, 3, 5, 1, 3]],
                                    names=['cty', 'tenor'])
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['cty', 'tenor'])

In [29]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.831154 -2.370232 -1.860761 -0.860757  0.560145
1     -1.265934  0.119827 -1.063512  0.332883 -2.359419
2     -0.199543 -1.541996 -0.970736 -1.307030  0.286350
3      0.377984 -0.753887  0.331286  1.349742  0.069877

In [30]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [31]:
hier_df.groupby(level='tenor', axis=1).count()

tenor  1  3  5
0      2  2  1
1      2  2  1
2      2  2  1
3      2  2  1

## Data Aggregation

In [32]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.246674 -1.549106
1    a  two -0.011862  0.022185
2    b  one  1.004812  0.758363
3    b  two  1.327195 -0.660524
4    a  one -0.919262  0.862580

In [33]:
grouped = df.groupby('key1')
grouped['data1'].quantile(0.9)

key1
a    0.194967
b    1.294956
Name: data1, dtype: float64

In [34]:
def peak_to_peak(arr):
    return arr.max() - arr.min()
grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.165936  2.411687
b     0.322383  1.418887

In [35]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.228150  0.612321 -0.919262 -0.465562 -0.011862  0.117406
b      2.0  1.166003  0.227959  1.004812  1.085407  1.166003  1.246599

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.246674   3.0 -0.221447  1.224163 -1.549106 -0.763461  0.022185
b     1.327195   2.0  0.048919  1.003305 -0.660524 -0.305802  0.048919


           75%       max
key1
a     0.442382  0.862580
b     0.403641  0.758363

In [36]:
grouped.agg(['mean', 'max', 'min'])

         data1                         data2
          mean       max       min      mean       max       min
key1
a    -0.228150  0.246674 -0.919262 -0.221447  0.862580 -1.549106
b     1.166003  1.327195  1.004812  0.048919  0.758363 -0.660524

### Column-Wise and Multiple Function Application

In [6]:
tips = pd.read_csv('examples/tips.csv')
# Add tip percentage of total bill
tips['tip_pct'] = tips['tip'] / tips['total_bill']
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [7]:
pd

In [9]:
grouped = tips.groupby(['day', 'smoker'])

In [10]:
grouped_pct = grouped['tip_pct']
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [11]:
def peak_to_peak(arr):
    return arr.max() - arr.min()
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [12]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [13]:
functions = ['count', 'mean', 'max']
result = grouped[['tip_pct', 'total_bill']].agg(functions)
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [14]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [15]:
#ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]
ftuples = [('평균', 'mean'), ('분산', np.var)]
grouped[['tip_pct', 'total_bill']].agg(ftuples)

              tip_pct           total_bill
                   평균        분산         평균          분산
day  smoker
Fri  No      0.151650  0.000791  18.420000   25.596333
     Yes     0.174783  0.002631  16.813333   82.562438
Sat  No      0.158048  0.001581  19.661778   79.908965
     Yes     0.147906  0.003767  21.276667  101.387535
Sun  No      0.160113  0.001793  20.506667   66.099980
     Yes     0.187250  0.023757  24.120000  109.046044
Thur No      0.160298  0.001503  17.113111   59.625081
     Yes     0.163863  0.001551  19.190588   69.808518

In [16]:
grouped.agg({'tip' : np.max, 'size' : 'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [17]:
grouped.agg({'tip' : np.min, 'size' : 'sum'})

              tip  size
day  smoker
Fri  No      1.50     9
     Yes     1.00    31
Sat  No      1.00   115
     Yes     1.00   104
Sun  No      1.01   167
     Yes     1.50    49
Thur No      1.25   112
     Yes     2.00    40

In [ ]:
grouped.agg({'tip_pct' : ['min', 'max', 'mean', np.std],
             'size' : 'sum'})

* 검사

In [ ]:
grouped1 = tips.groupby(len, axis=1).count()
grouped1

### Returning Aggregated Data Without Row Indexes

In [18]:
tips.groupby(['day', 'smoker'], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [19]:
tips.groupby(['day', 'smoker'], as_index=True).mean()

             total_bill       tip      size   tip_pct
day  smoker
Fri  No       18.420000  2.812500  2.250000  0.151650
     Yes      16.813333  2.714000  2.066667  0.174783
Sat  No       19.661778  3.102889  2.555556  0.158048
     Yes      21.276667  2.875476  2.476190  0.147906
Sun  No       20.506667  3.167895  2.929825  0.160113
     Yes      24.120000  3.516842  2.578947  0.187250
Thur No       17.113111  2.673778  2.488889  0.160298
     Yes      19.190588  3.030000  2.352941  0.163863

## Apply: General split-apply-combine

In [ ]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]
top(tips, n=6)

In [ ]:
tips.groupby('smoker').apply(top)

In [ ]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

In [ ]:
result = tips.groupby('smoker')['tip_pct'].describe()
result

In [ ]:
result.unstack('smoker')

In [ ]:
result.stack()

In [ ]:
result.unstack()

In [ ]:
f = lambda x: x.describe()
tips.groupby('smoker')['tip_pct'].apply(f)

f = lambda x: x.describe()
grouped.apply(f)

### Suppressing the Group Keys

In [ ]:
tips.groupby('smoker', group_keys=False).apply(top)

In [ ]:
tips.groupby('smoker').apply(top)

### Quantile and Bucket Analysis

In [20]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                      'data2': np.random.randn(1000)})
frame

        data1     data2
0    1.007189  0.884111
1   -1.296221 -0.608506
2    0.274992 -0.072052
3    0.228913  0.544066
4    1.352917  0.323886
..        ...       ...
995  0.334088  1.212354
996  0.488675 -1.613474
997 -0.178098 -0.573966
998  2.122315  0.424894
999  0.061192  1.257544

[1000 rows x 2 columns]

In [23]:
quartiles = pd.cut(frame.data1, 4)
quartiles

0       (0.489, 2.208]
1      (-2.956, -1.23]
2       (-1.23, 0.489]
3       (-1.23, 0.489]
4       (0.489, 2.208]
            ...
995     (-1.23, 0.489]
996     (-1.23, 0.489]
997     (-1.23, 0.489]
998     (0.489, 2.208]
999     (-1.23, 0.489]
Name: data1, Length: 1000, dtype: category
Categories (4, interval[float64]): [(-2.956, -1.23] < (-1.23, 0.489] < (0.489, 2.208] < (2.208, 3.928]]

In [24]:
quartiles[:10]

0     (0.489, 2.208]
1    (-2.956, -1.23]
2     (-1.23, 0.489]
3     (-1.23, 0.489]
4     (0.489, 2.208]
5     (0.489, 2.208]
6    (-2.956, -1.23]
7     (-1.23, 0.489]
8     (0.489, 2.208]
9     (-1.23, 0.489]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-2.956, -1.23] < (-1.23, 0.489] < (0.489, 2.208] < (2.208, 3.928]]

In [25]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
            'count': group.count(), 'mean': group.mean()}
grouped = frame.data2.groupby(quartiles)
grouped

In [26]:
grouped.apply(get_stats)

data1
(-2.956, -1.23]  min       -3.399312
                 max        1.670835
                 count     96.000000
                 mean      -0.063122
(-1.23, 0.489]   min       -2.989741
                 max        3.260383
                 count    596.000000
                 mean      -0.003908
(0.489, 2.208]   min       -3.745356
                 max        2.954439
                 count    297.000000
                 mean       0.092315
(2.208, 3.928]   min       -1.929776
                 max        1.765640
                 count     11.000000
                 mean       0.030607
Name: data2, dtype: float64

In [27]:
grouped.apply(get_stats).unstack()

                      min       max  count      mean
data1
(-2.956, -1.23] -3.399312  1.670835   96.0 -0.063122
(-1.23, 0.489]  -2.989741  3.260383  596.0 -0.003908
(0.489, 2.208]  -3.745356  2.954439  297.0  0.092315
(2.208, 3.928]  -1.929776  1.765640   11.0  0.030607

In [ ]:
# Return quantile numbers
#grouping = pd.qcut(frame.data1, 10, labels=False)
grouping = pd.qcut(frame.data1, 10)
grouped = frame.data2.groupby(grouping)
grouped.apply(get_stats)

In [ ]:
grouped.apply(get_stats).unstack()

### Example: Filling Missing Values with Group-Specific       Values

In [28]:
s = pd.Series(np.random.randn(6))
s[::2] = np.nan
s

0         NaN
1    0.276356
2         NaN
3   -0.679335
4         NaN
5   -1.930931
dtype: float64

In [29]:
s.fillna(s.mean())

0   -0.777970
1    0.276356
2   -0.777970
3   -0.679335
4   -0.777970
5   -1.930931
dtype: float64

In [31]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
          'Oregon', 'Nevada', 'California', 'Idaho']
data = pd.Series(np.random.randn(8), index=states)
data

Ohio          0.560161
New York     -0.815368
Vermont       1.004914
Florida       0.361801
Oregon       -0.340487
Nevada        0.462387
California   -0.866780
Idaho         0.653270
dtype: float64

In [32]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan
data

Ohio          0.560161
New York     -0.815368
Vermont            NaN
Florida       0.361801
Oregon       -0.340487
Nevada             NaN
California   -0.866780
Idaho              NaN
dtype: float64

In [33]:
group_key = ['East'] * 4 + ['West'] * 4
data.groupby(group_key)

In [34]:
data.groupby(group_key).mean()  # Ohio부터 Florida 까지 4개는 East로 설정하여서 mean
                                # 평균 값을 구해라

East    0.035531
West   -0.603634
dtype: float64

In [35]:
fill_mean = lambda g: g.fillna(g.mean())
data.groupby(group_key).apply(fill_mean)  # NaN 값을 각각 East와 West에 맞게 평균값으로 
                                          # 채워주어라

Ohio          0.560161
New York     -0.815368
Vermont       0.035531
Florida       0.361801
Oregon       -0.340487
Nevada       -0.603634
California   -0.866780
Idaho        -0.603634
dtype: float64

In [38]:
fill_values = {'East': 0.5, 'West': -1}
fill_values

{'East': 0.5, 'West': -1}

In [39]:
fill_func = lambda g: g.fillna(fill_values[g.name])
data.groupby(group_key).apply(fill_func)

Ohio          0.560161
New York     -0.815368
Vermont       0.500000
Florida       0.361801
Oregon       -0.340487
Nevada       -1.000000
California   -0.866780
Idaho        -1.000000
dtype: float64

In [ ]:
group_key = ['East'] * 4 + ['West'] * 4
data.groupby(group_key).mean()

In [ ]:
fill_values = {'East': 0.5, 'West': -1}
fill_func = lambda g: g.fillna(fill_values[g.name])
data2 = data.groupby(group_key).apply(fill_func)
data2.groupby(group_key).mean()

### Example: Random Sampling and Permutation

In [40]:
# Hearts, Spades, Clubs, Diamonds
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
cards = []
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)

deck = pd.Series(card_val, index=cards)
deck

AH      1
2H      2
3H      3
4H      4
5H      5
       ..
9D      9
10D    10
JD     10
KD     10
QD     10
Length: 52, dtype: int64

In [41]:
# Hearts, Spades, Clubs, Diamonds
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
card_val

[1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 10,
 10,
 10,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 10,
 10,
 10,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 10,
 10,
 10,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 10,
 10,
 10]

In [42]:
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
base_names

['A', 2, 3, 4, 5, 6, 7, 8, 9, 10, 'J', 'K', 'Q']

In [43]:
cards = []
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)

deck = pd.Series(card_val, index=cards)
deck

AH      1
2H      2
3H      3
4H      4
5H      5
       ..
9D      9
10D    10
JD     10
KD     10
QD     10
Length: 52, dtype: int64

In [45]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [46]:
[cards[:12], cards[-12:]]

[['AH', '2H', '3H', '4H', '5H', '6H', '7H', '8H', '9H', '10H', 'JH', 'KH'],
 ['2D', '3D', '4D', '5D', '6D', '7D', '8D', '9D', '10D', 'JD', 'KD', 'QD']]

In [47]:
def draw(deck, n=5):
    return deck.sample(n)
draw(deck)

AD     1
QH    10
JS    10
7D     7
4H     4
dtype: int64

In [48]:
[cards[:12], cards[13:25], cards[26:38], cards[-12:]]

[['AH', '2H', '3H', '4H', '5H', '6H', '7H', '8H', '9H', '10H', 'JH', 'KH'],
 ['AS', '2S', '3S', '4S', '5S', '6S', '7S', '8S', '9S', '10S', 'JS', 'KS'],
 ['AC', '2C', '3C', '4C', '5C', '6C', '7C', '8C', '9C', '10C', 'JC', 'KC'],
 ['2D', '3D', '4D', '5D', '6D', '7D', '8D', '9D', '10D', 'JD', 'KD', 'QD']]

In [49]:
get_suit = lambda card: card[-1] # last letter is suit
deck.groupby(get_suit).apply(draw, n=2)

C  7C     7
   QC    10
D  QD    10
   8D     8
H  KH    10
   JH    10
S  9S     9
   4S     4
dtype: int64

In [50]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

2C      2
QC     10
AD      1
10D    10
6H      6
5H      5
2S      2
3S      3
dtype: int64

### Example: Group Weighted Average and Correlation

In [ ]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a',
                                'b', 'b', 'b', 'b'],
                   'data': np.random.randn(8),
                   'weights': np.random.rand(8)})
df

In [ ]:
grouped = df.groupby('category')
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])
grouped.apply(get_wavg)

* 미국 주식

In [ ]:
!chcp 65001

In [ ]:
!type examples\stock_px_2.csv

In [ ]:
close_px = pd.read_csv('examples/stock_px_2.csv', parse_dates=True,
                       index_col=0)
close_px.shape

In [ ]:
close_px = pd.read_csv('examples/stock_px_2.csv', index_col=0)
close_px.shape

In [ ]:
close_px.info()

In [ ]:
close_px.index

In [ ]:
close_px[-4:]

In [ ]:
spx_corr = lambda x: x.corrwith(x['SPX'])

In [ ]:
rets = close_px.pct_change().dropna()

In [ ]:
get_year = lambda x: x.year
by_year = rets.groupby(get_year)
by_year.apply(spx_corr)

In [ ]:
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

### Example: Group-Wise Linear Regression

In [ ]:
import statsmodels.api as sm

In [ ]:
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1.
    result = sm.OLS(Y, X).fit()
    print(result.summary)
    return result.params

In [ ]:
'''Y = by_year['AAPL']
X = by_year[['SPX']]
#X['intercept'] = 1.
result = sm.OLS(Y, X).fit()
print(result.summary)
print(result.params)
'''

In [ ]:
by_year.apply(regress, 'AAPL', ['SPX'])

## Pivot Tables and Cross-Tabulation

* 기본

In [ ]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

In [ ]:
table = pd.pivot_table(df, values='D', index=['A', 'B'],
                    columns=['C'], aggfunc=np.sum)
table

In [ ]:
table = pd.pivot_table(df, values='D', index=['A', 'B'],
                    columns=['C'], aggfunc=np.sum, fill_value=0)
table

In [ ]:
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
                    aggfunc={'D': np.mean,
                             'E': np.mean})
table

In [ ]:
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
                    aggfunc={'D': np.mean,
                             'E': [min, max, np.mean]})
table

* 팁 데이터

In [ ]:
tips.pivot_table(index=['day', 'smoker'])

In [ ]:
tips.groupby(['day', 'smoker']).mean()

In [ ]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
                 columns='smoker')

In [ ]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
                 columns='smoker', margins=True)

In [ ]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day', 'smoker'],
                 margins=True)

In [ ]:
tips.pivot_table('tip_pct', index=['time', 'smoker'], columns='day',
                 aggfunc=len, margins=True)

In [ ]:
tips

In [ ]:
tips.pivot_table('tip_pct', index=['time', 'size', 'smoker'],
                 columns='day', aggfunc='mean', fill_value=0)

In [ ]:
tips.pivot_table('tip_pct', index=['time', 'size', 'smoker'],
                 columns='day', aggfunc='mean')

In [ ]:
tips.pivot_table('tip_pct', index=['time', 'size', 'smoker'],
                 columns='day', aggfunc='mean', dropna=True)

### Cross-Tabulations: Crosstab

In [51]:
from io import StringIO
data = """\
Sample  Nationality  Handedness
1   USA  Right-handed
2   Japan    Left-handed
3   USA  Right-handed
4   Japan    Right-handed
5   Japan    Left-handed
6   Japan    Right-handed
7   USA  Right-handed
8   USA  Left-handed
9   Japan    Right-handed
10  USA  Right-handed"""
data = pd.read_table(StringIO(data), sep='\s+')

In [52]:
data

   Sample Nationality    Handedness
0       1         USA  Right-handed
1       2       Japan   Left-handed
2       3         USA  Right-handed
3       4       Japan  Right-handed
4       5       Japan   Left-handed
5       6       Japan  Right-handed
6       7         USA  Right-handed
7       8         USA   Left-handed
8       9       Japan  Right-handed
9      10         USA  Right-handed

In [53]:
pd.crosstab(data.Nationality, data.Handedness, margins=True)

Handedness   Left-handed  Right-handed  All
Nationality
Japan                  2             3    5
USA                    1             4    5
All                    3             7   10

In [54]:
data.pivot_table('Sample', index='Nationality', columns='Handedness',
                 aggfunc=len, margins=True)

Handedness   Left-handed  Right-handed  All
Nationality
Japan                  2             3    5
USA                    1             4    5
All                    3             7   10

In [55]:
data.pivot_table(index='Nationality', columns='Handedness',
                 aggfunc=len, margins=True)

                 Sample
Handedness  Left-handed Right-handed All
Nationality
Japan                 2            3   5
USA                   1            4   5
All                   3            7  10

In [56]:
pd.crosstab([tips.time, tips.day], tips.smoker, margins=True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244

In [57]:
tips.pivot_table('size', index=['time', 'day'], columns='smoker',
                 aggfunc=len, margins=True, fill_value=0)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244

In [58]:
tips.pivot_table('tip_pct', index=['time', 'day'], columns='smoker',
                 aggfunc=len, margins=True, fill_value=0)

smoker        No  Yes    All
time   day
Dinner Fri     3    9   12.0
       Sat    45   42   87.0
       Sun    57   19   76.0
       Thur    1    0    1.0
Lunch  Fri     1    6    7.0
       Thur   44   17   61.0
All          151   93  244.0

In [59]:
tips

     total_bill   tip smoker   day    time  size   tip_pct
0         16.99  1.01     No   Sun  Dinner     2  0.059447
1         10.34  1.66     No   Sun  Dinner     3  0.160542
2         21.01  3.50     No   Sun  Dinner     3  0.166587
3         23.68  3.31     No   Sun  Dinner     2  0.139780
4         24.59  3.61     No   Sun  Dinner     4  0.146808
..          ...   ...    ...   ...     ...   ...       ...
239       29.03  5.92     No   Sat  Dinner     3  0.203927
240       27.18  2.00    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75     No   Sat  Dinner     2  0.098204
243       18.78  3.00     No  Thur  Dinner     2  0.159744

[244 rows x 7 columns]

In [60]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS

In [61]:
a = np.array(["foo", "foo", "foo", "foo", "bar", "bar",
              "bar", "bar", "foo", "foo", "foo"], dtype=object)
a

array(['foo', 'foo', 'foo', 'foo', 'bar', 'bar', 'bar', 'bar', 'foo',
       'foo', 'foo'], dtype=object)

In [62]:
b = np.array(["one", "one", "one", "two", "one", "one",
              "one", "two", "two", "two", "one"], dtype=object)
b

array(['one', 'one', 'one', 'two', 'one', 'one', 'one', 'two', 'two',
       'two', 'one'], dtype=object)

In [63]:
c = np.array(["dull", "dull", "shiny", "dull", "dull", "shiny",
              "shiny", "dull", "shiny", "shiny", "shiny"],
             dtype=object)
c

array(['dull', 'dull', 'shiny', 'dull', 'dull', 'shiny', 'shiny', 'dull',
       'shiny', 'shiny', 'shiny'], dtype=object)

In [64]:
pd.crosstab(a, [b, c], rownames=['a'], colnames=['b', 'c'])

b    one        two
c   dull shiny dull shiny
a
bar    1     2    1     0
foo    2     2    1     2

In [65]:
foo = pd.Categorical(['a', 'b'], categories=['a', 'b', 'c'])
foo

[a, b]
Categories (3, object): [a, b, c]

In [66]:
bar = pd.Categorical(['d', 'e'], categories=['d', 'e', 'f'])
bar

[d, e]
Categories (3, object): [d, e, f]

In [67]:
pd.crosstab(foo, bar)

col_0  d  e
row_0
a      1  0
b      0  1

In [68]:
foo = pd.Categorical(['a', 'b', 'a'], categories=['a', 'b', 'c'])
foo

[a, b, a]
Categories (3, object): [a, b, c]

In [69]:
bar = pd.Categorical(['d', 'e', 'e'], categories=['d', 'e', 'f'])
bar

[d, e, e]
Categories (3, object): [d, e, f]

In [70]:
pd.crosstab(foo, bar)

col_0  d  e
row_0
a      1  1
b      0  1

## Conclusion

In [ ]:
df

In [ ]:
df['data1']

In [ ]:
type(df['data1'])

In [ ]:
df[['data1']]

In [ ]:
type(df[['data1']])